DataProcessors/ПростойИнтерфейсРазделСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПростойИнтерфейсРазделСотрудники</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВАрхиве</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗанятости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительныйЛист</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплатеДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченоДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплатеДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченоДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоловнаяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоловнойСотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеРабочееМестоВОрганизации</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОформленПоТрудовомуДоговору</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОформленПоДоговоруПодряда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отступ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяДолжность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяТарифнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееПодразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийПроцентСевернойНадбавки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСпособРасчетаАванса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаАванса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УточнениеНаименования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЛетногоЭкипажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШахтерскойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяФармацевтическойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияУчетаЗабронированных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляУчетаЗабронированных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛетноПодъемныйСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плавсостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаЛетныхЭкипажей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаЛетныхЭкипажей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаШахтеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаШахтеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЕдиноличногоРуководителяКоммерческойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПростойИнтерфейсРазделСотрудники/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура собирает данные о состоянии взаиморасчетов с сотрудниками
// Параметры:
//  ПараметрыОбработки - Структура - см. НовыйПараметрыОбработки()
//  АдресХранилища - Строка - адрес временного хранилища, в которое помещается результат выполнения
//
Процедура ПодготовитьДанные(ПараметрыОбработки, АдресХранилища) Экспорт
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ОбновитьВесьСписок",  Ложь);
	РезультатВыполнения.Вставить("ОбновитьСотрудников", Ложь);
	РезультатВыполнения.Вставить("Список", "");
	
	Организация                   = ПараметрыОбработки.Организация;
	РолиСотрудников               = ПараметрыОбработки.РолиСотрудников;
	ВключатьСведенияПоСотрудникам = ПараметрыОбработки.ВключатьСведенияПоСотрудникам;
	ПериодРегистрации             = ПараметрыОбработки.ПериодРегистрации;
	ПериодРегистрацииНачало       = НачалоМесяца(ПериодРегистрации);
	ПериодРегистрацииКонец        = КонецМесяца(ПериодРегистрации);
	ПериодОборотов                = ПараметрыОбработки.ТекущаяДатаРаботы;
	ПериодОстатков                = ДобавитьМесяц(ПараметрыОбработки.ТекущаяДатаРаботы, 1);
	МассивСотрудников             = ПараметрыОбработки.МассивСотрудников;
	Параметр                      = ПараметрыОбработки.Параметр;
	
	Если ЗначениеЗаполнено(Параметр) И МассивСотрудников = Неопределено Тогда
		МассивСотрудников = МассивСотрудниковПоПараметру(Организация, Параметр);
		Если МассивСотрудников.Количество() = 0 Тогда
			ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеСтатейРасходов = ЗарплатаКадры.СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами();
	СтатьяРасходов = ОписаниеСтатейРасходов[Перечисления.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами];
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачислениеДивидендов.Ссылка КАК Ссылка,
	|	НачислениеДивидендов.Учредитель КАК ФизическоеЛицо,
	|	СУММА(НачислениеДивидендов.СуммаДохода) КАК НачисленоДивиденды,
	|	СУММА(НачислениеДивидендов.СуммаНалога + НачислениеДивидендов.СуммаНалогаСПревышения) КАК НДФЛДивиденды
	|ПОМЕСТИТЬ ВТ_ДокументыДивидендов
	|ИЗ
	|	Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|ГДЕ
	|	НачислениеДивидендов.Дата МЕЖДУ &ПериодРегистрацииНачало И &ПериодРегистрацииКонец
	|	И НачислениеДивидендов.Проведен
	|	И НачислениеДивидендов.ТипУчредителя = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	И НачислениеДивидендов.Организация В (&Организация)
	|СГРУППИРОВАТЬ ПО
	|	НачислениеДивидендов.Ссылка,
	|	НачислениеДивидендов.Учредитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыДивидендов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВТ_ДокументыДивидендов.НачисленоДивиденды) КАК НачисленоДивиденды,
	|	СУММА(ВТ_ДокументыДивидендов.НДФЛДивиденды) КАК НДФЛДивиденды
	|ПОМЕСТИТЬ ВТ_Дивиденды
	|ИЗ
	|	ВТ_ДокументыДивидендов КАК ВТ_ДокументыДивидендов
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыДивидендов.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК
	|			ПланВидовРасчета.Начисления).КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	|		ИЛИ НЕ ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК
	|			ПланВидовРасчета.Начисления).КодДоходаСтраховыеВзносы В
	|		(ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом),
	|			ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом))
	|		ИЛИ ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления) В
	|		(ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги))
	|			ТОГДА НачисленияУдержанияПоСотрудникам.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Начислено,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛ)
	|		ИЛИ
	|			НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения)
	|			ТОГДА НачисленияУдержанияПоСотрудникам.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК НДФЛ,
	|	СУММА(ВЫБОР
	|		КОГДА НачисленияУдержанияПоСотрудникам.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|			ТОГДА НачисленияУдержанияПоСотрудникам.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ИсполнительныйЛист,
	|	СУММА(ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК
	|			Перечисление.ВидыОсобыхНачисленийИУдержаний) = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|			ТОГДА НачисленияУдержанияПоСотрудникам.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК НачисленоДоговоры
	|ПОМЕСТИТЬ ВТ_НачисленияУдержанияПоСотрудникам
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(&ПериодРегистрацииНачало, &ПериодРегистрацииКонец,,
	|		Организация В (&Организация)) КАК НачисленияУдержанияПоСотрудникам
	|{ГДЕ
	|	НачисленияУдержанияПоСотрудникам.Сотрудник.*}
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникам.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СписаниеСРасчетногоСчета.СуммаДокумента) КАК СуммаДокумента,
	|	СписаниеСРасчетногоСчета.Контрагент КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплатаДивидендовПромежуточная
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Проведен
	|	И
	|		СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДивидендов)
	|	И СписаниеСРасчетногоСчета.НачислениеДивидендов В
	|		(ВЫБРАТЬ
	|			ВТ_ДокументыДивидендов.Ссылка
	|		ИЗ
	|			ВТ_ДокументыДивидендов)
	|	И СписаниеСРасчетногоСчета.Организация В (&Организация)
	|СГРУППИРОВАТЬ ПО
	|	СписаниеСРасчетногоСчета.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(РасходныйКассовыйОрдер.СуммаДокумента),
	|	РасходныйКассовыйОрдер.Контрагент
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыплатаДивидендов)
	|	И РасходныйКассовыйОрдер.НачислениеДивидендов В
	|		(ВЫБРАТЬ
	|			ВТ_ДокументыДивидендов.Ссылка
	|		ИЗ
	|			ВТ_ДокументыДивидендов)
	|	И РасходныйКассовыйОрдер.Организация В (&Организация)
	|СГРУППИРОВАТЬ ПО
	|	РасходныйКассовыйОрдер.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ВыплатаДивидендовПромежуточная.СуммаДокумента) КАК СуммаДокумента,
	|	ВТ_ВыплатаДивидендовПромежуточная.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплатаДивидендов
	|ИЗ
	|	ВТ_ВыплатаДивидендовПромежуточная КАК ВТ_ВыплатаДивидендовПромежуточная
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплатаДивидендовПромежуточная.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ЗарплатаКВыплатеОбороты.СуммаКВыплатеРасход) КАК Выплачено
	|ПОМЕСТИТЬ ВТ_Выплаты
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(&ПериодРегистрацииНачало, &ПериодОборотов, Период, Организация В
	|	(&Организация)
	|	И ПериодВзаиморасчетов = &ПериодРегистрации
	|	И СтатьяРасходов <> &СтатьяРасходов {(Сотрудник).*}) КАК ЗарплатаКВыплатеОбороты
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОбороты.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ЗарплатаКВыплатеОбороты.СуммаКВыплатеРасход) КАК Выплачено
	|ПОМЕСТИТЬ ВТ_ВыплатыПоДоговорам
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(&ПериодРегистрацииНачало, &ПериодОборотов, Период, Организация В
	|	(&Организация)
	|	И ПериодВзаиморасчетов = &ПериодРегистрации
	|	И СтатьяРасходов = &СтатьяРасходов {(Сотрудник).*}) КАК ЗарплатаКВыплатеОбороты
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОбороты.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|	КОНЕЦ) КАК КВыплате
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(&ПериодОстатков, Организация В (&Организация)
	|	И ПериодВзаиморасчетов <= &ПериодРегистрации
	|	И СтатьяРасходов <> &СтатьяРасходов {(Сотрудник).*}) КАК ЗарплатаКВыплатеОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОстатки.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|	КОНЕЦ) КАК КВыплате
	|ПОМЕСТИТЬ ВТ_ОстаткиПоДоговорам
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(&ПериодОстатков, Организация В (&Организация)
	|	И ПериодВзаиморасчетов <= &ПериодРегистрации
	|	И СтатьяРасходов = &СтатьяРасходов {(Сотрудник).*}) КАК ЗарплатаКВыплатеОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОстатки.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РолиСотрудников.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_РолиСотрудниковДоговорники
	|ИЗ
	|	РегистрСведений.РолиСотрудников КАК РолиСотрудников
	|ГДЕ
	|	РольСотрудника = ЗНАЧЕНИЕ(Перечисление.РолиСотрудников.Договорник)
	|{ГДЕ
	|	РолиСотрудников.Сотрудник.*,
	|	РолиСотрудников.РольСотрудника.*}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущаяТарифнаяСтавкаСотрудников.ТекущаяТарифнаяСтавка КАК ТекущаяТарифнаяСтавка,
	|	ТекущаяТарифнаяСтавкаСотрудников.ТекущийСпособРасчетаАванса КАК ТекущийСпособРасчетаАванса,
	|	ТекущаяТарифнаяСтавкаСотрудников.ТекущийАванс КАК ТекущийАванс,
	|	ТекущаяТарифнаяСтавкаСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущаяТарифнаяСтавкаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ТекущаяТарифнаяСтавкаСотрудников
	|ИЗ
	|	РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников КАК ТекущаяТарифнаяСтавкаСотрудников
	|ГДЕ
	|	ТекущаяТарифнаяСтавкаСотрудников.ТекущаяОрганизация В (&Организация)
	|	ИЛИ ТекущаяТарифнаяСтавкаСотрудников.ТекущаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|{ГДЕ
	|	ТекущаяТарифнаяСтавкаСотрудников.Сотрудник.*}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости КАК ТекущийВидЗанятости,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации КАК ОсновноеРабочееМестоВОрганизации,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация КАК ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ТекущиеКадровыеДанныеСотрудников
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация В (&Организация)
	|	ИЛИ ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|{ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.* КАК Сотрудник}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникСотрудники.Ссылка КАК Ссылка,
	|	СправочникСотрудники.ВерсияДанных КАК ВерсияДанных,
	|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникСотрудники.Предопределенный КАК Предопределенный,
	|	СправочникСотрудники.Код КАК Код,
	|	СправочникСотрудники.Наименование КАК Наименование,
	|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СправочникСотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СправочникСотрудники.ТекущийПроцентСевернойНадбавки КАК ТекущийПроцентСевернойНадбавки,
	|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
	|	СправочникСотрудники.УточнениеНаименования КАК УточнениеНаименования,
	|	СправочникСотрудники.ГоловнойСотрудник КАК ГоловнойСотрудник,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка)) КАК ВидЗанятости,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации, ЛОЖЬ) КАК
	|		ОсновноеРабочееМестоВОрганизации,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК
	|		ТекущаяОрганизация,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|		ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ТекущееПодразделение,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК
	|		ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
	|	ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
	|	ЕСТЬNULL(ВТ_ТекущаяТарифнаяСтавкаСотрудников.ТекущаяТарифнаяСтавка, 0) КАК ТекущаяТарифнаяСтавка,
	|	ЕСТЬNULL(ВТ_ТекущаяТарифнаяСтавкаСотрудников.ТекущийСпособРасчетаАванса,
	|		ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаАванса.ПустаяСсылка)) КАК ТекущийСпособРасчетаАванса,
	|	ЕСТЬNULL(ВТ_ТекущаяТарифнаяСтавкаСотрудников.ТекущийАванс, 0) КАК ТекущийАванс,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОформленПоТрудовомуДоговору,
	|	НЕ ВТ_РолиСотрудниковДоговорники.Сотрудник ЕСТЬ NULL КАК ОформленПоДоговоруПодряда,
	|	ЕСТЬNULL(СправочникСотрудники.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)), МЕСЯЦ) КАК МесяцПриема,
	|	ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.Начислено, 0) КАК Начислено,
	|	ЕСТЬNULL(ВТ_Дивиденды.НачисленоДивиденды, 0) КАК НачисленоДивиденды,
	|	ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.НачисленоДоговоры, 0) КАК НачисленоДоговоры,
	|	ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.НДФЛ, 0) +
	|		ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.ИсполнительныйЛист, 0) КАК Удержано,
	|	ЕСТЬNULL(ВТ_Выплаты.Выплачено, 0) КАК Выплачено,
	|	ЕСТЬNULL(ВТ_ВыплатаДивидендов.СуммаДокумента, 0) КАК ВыплаченоДивиденды,
	|	ЕСТЬNULL(ВТ_ВыплатыПоДоговорам.Выплачено, 0) КАК ВыплаченоДоговоры,
	|	ЕСТЬNULL(ВТ_Остатки.КВыплате, 0) КАК КВыплате,
	|	ЕСТЬNULL(ВТ_ОстаткиПоДоговорам.КВыплате, 0) КАК КВыплатеДоговоры,
	|	ЕСТЬNULL(ВТ_Дивиденды.НачисленоДивиденды, 0) - ЕСТЬNULL(ВТ_Дивиденды.НДФЛДивиденды, 0) -
	|		ЕСТЬNULL(ВТ_ВыплатаДивидендов.СуммаДокумента, 0) КАК КВыплатеДивиденды,
	|	ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.НДФЛ, 0) КАК НДФЛ,
	|	ЕСТЬNULL(ВТ_Дивиденды.НДФЛДивиденды, 0) КАК НДФЛДивиденды,
	|	ЕСТЬNULL(ВТ_НачисленияУдержанияПоСотрудникам.ИсполнительныйЛист, 0) КАК ИсполнительныйЛист,
	|	ИСТИНА КАК Работает,
	|	0 КАК Картинка
	|ИЗ
	|	Справочник.Сотрудники КАК СправочникСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущиеКадровыеДанныеСотрудников КАК ВТ_ТекущиеКадровыеДанныеСотрудников
	|		ПО СправочникСотрудники.Ссылка = ВТ_ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|		И СправочникСотрудники.ФизическоеЛицо = ВТ_ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТарифнаяСтавкаСотрудников КАК ВТ_ТекущаяТарифнаяСтавкаСотрудников
	|		ПО СправочникСотрудники.Ссылка = ВТ_ТекущаяТарифнаяСтавкаСотрудников.Сотрудник
	|		И СправочникСотрудники.ФизическоеЛицо = ВТ_ТекущаяТарифнаяСтавкаСотрудников.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияУдержанияПоСотрудникам КАК ВТ_НачисленияУдержанияПоСотрудникам
	|		ПО СправочникСотрудники.Ссылка = ВТ_НачисленияУдержанияПоСотрудникам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выплаты КАК ВТ_Выплаты
	|		ПО СправочникСотрудники.Ссылка = ВТ_Выплаты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО СправочникСотрудники.Ссылка = ВТ_Остатки.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дивиденды КАК ВТ_Дивиденды
	|		ПО СправочникСотрудники.ФизическоеЛицо = ВТ_Дивиденды.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыплатаДивидендов КАК ВТ_ВыплатаДивидендов
	|		ПО СправочникСотрудники.ФизическоеЛицо = ВТ_ВыплатаДивидендов.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыплатыПоДоговорам КАК ВТ_ВыплатыПоДоговорам
	|		ПО СправочникСотрудники.Ссылка = ВТ_ВыплатыПоДоговорам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПоДоговорам КАК ВТ_ОстаткиПоДоговорам
	|		ПО СправочникСотрудники.Ссылка = ВТ_ОстаткиПоДоговорам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РолиСотрудниковДоговорники КАК ВТ_РолиСотрудниковДоговорники
	|		ПО СправочникСотрудники.Ссылка = ВТ_РолиСотрудниковДоговорники.Сотрудник
	|ГДЕ
	|	СправочникСотрудники.ГоловнаяОрганизация В (&Организация)
	|{ГДЕ
	|	СправочникСотрудники.Ссылка.* КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОформленПоТрудовомуДоговору,
	|	НЕ ВТ_РолиСотрудниковДоговорники.Сотрудник ЕСТЬ NULL КАК ОформленПоДоговоруПодряда}";
	
	Если Не ЗначениеЗаполнено(СтатьяРасходов) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтатьяРасходов <> &СтатьяРасходов", "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтатьяРасходов = &СтатьяРасходов", "Ложь");
	КонецЕсли;
	
	Если Не ВключатьСведенияПоСотрудникам Тогда
		УдалитьСведенияОСотрудниках(ТекстЗапроса);
	КонецЕсли;

	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = ТекстЗапроса;
	
	Если МассивСотрудников <> Неопределено 
		И ЗначениеЗаполнено(МассивСотрудников) Тогда
		СписокСотрудников = Новый СписокЗначений;
		Для Каждого Сотрудник Из МассивСотрудников Цикл
			СписокСотрудников.Добавить(Сотрудник);
		КонецЦикла;
		ЭлементОтбора = Запрос.Отбор.Добавить("Сотрудник");
		ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Значение      = СписокСотрудников;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РолиСотрудников) Тогда
		
		Если РолиСотрудников = Перечисления.РолиСотрудников.Работник 
			И Запрос.ДоступныеПоля.Найти("ОформленПоТрудовомуДоговору") <> Неопределено Тогда
			
			ЭлементОтбора = Запрос.Отбор.Добавить("ОформленПоТрудовомуДоговору");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.Значение      = Истина;
			
		ИначеЕсли РолиСотрудников = Перечисления.РолиСотрудников.Договорник
			И Запрос.ДоступныеПоля.Найти("ОформленПоДоговоруПодряда") <> Неопределено Тогда
			
			ЭлементОтбора = Запрос.Отбор.Добавить("ОформленПоДоговоруПодряда");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.Значение      = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		Организация = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.Организации.ПустаяСсылка());
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			Организация, ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь));
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Организация",             Организация); 
	Запрос.Параметры.Вставить("ПериодРегистрации",       ПериодРегистрации);
	Запрос.Параметры.Вставить("ПериодРегистрацииНачало", ПериодРегистрацииНачало);
	Запрос.Параметры.Вставить("ПериодРегистрацииКонец",  ПериодРегистрацииКонец);
	Запрос.Параметры.Вставить("ПериодОборотов",          ПериодОборотов);
	Запрос.Параметры.Вставить("ПериодОстатков",          ПериодОстатков);
	Запрос.Параметры.Вставить("МассивСотрудников",       МассивСотрудников);
	Запрос.Параметры.Вставить("СтатьяРасходов",          СтатьяРасходов);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.ПолучитьЗапрос().Выполнить();
	Результат = Выборка.Выгрузить();
	УстановитьСтатусыСотрудников(Результат, ПериодРегистрации);
	
	РезультатВыполнения.Вставить("ОбновитьВесьСписок",  ?(МассивСотрудников = Неопределено, Истина, Ложь));
	РезультатВыполнения.Вставить("ОбновитьСотрудников", ?(МассивСотрудников <> Неопределено, Истина, Ложь));
	РезультатВыполнения.Вставить("Список", Результат);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

// Процедура устанавливает статус сотрудника: работает он или нет, и номер картинки для отображения в таблице
// Параметры:
//   СведенияОСотруднике - Строка таблицы значений
//   ПериодРегистрации   - Дата - дата месяца за который выводятся данные
//
Процедура УстановитьСтатусСотрудника(СведенияОСотруднике, ПериодРегистрации) Экспорт
	
	ПериодРегистрацииНачало = НачалоМесяца(ПериодРегистрации);
	ПериодРегистрацииКонец  = КонецМесяца(ПериодРегистрации);
	
	Если СведенияОСотруднике.ПометкаУдаления Тогда
		СведенияОСотруднике.Работает = Ложь;
	ИначеЕсли (Не ЗначениеЗаполнено(СведенияОСотруднике.ДатаУвольнения) Или КонецМесяца(СведенияОСотруднике.ДатаУвольнения) >= ПериодРегистрацииКонец)
		И ЗначениеЗаполнено(СведенияОСотруднике.ДатаПриема)
		И НачалоМесяца(СведенияОСотруднике.ДатаПриема) <= ПериодРегистрацииНачало Тогда
		СведенияОСотруднике.Работает = Истина;
	Иначе
		СведенияОСотруднике.Работает = Ложь;
	КонецЕсли;
	
	Если СведенияОСотруднике.ПометкаУдаления Тогда
		СведенияОСотруднике.Картинка = 2;
	Иначе
		Если НЕ СведенияОСотруднике.Работает Тогда
			СведенияОСотруднике.Картинка = 3;
		Иначе
			Если ЗначениеЗаполнено(СведенияОСотруднике.ДатаРождения)
				И Месяц(СведенияОСотруднике.ДатаРождения) = Месяц(ПериодРегистрации) Тогда
				СведенияОСотруднике.Картинка = 4;
			Иначе
				СведенияОСотруднике.Картинка = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не СведенияОСотруднике.Работает
		И СведенияОСотруднике.ОформленПоДоговоруПодряда Тогда
		// 100% договорника просто показываем
		СведенияОСотруднике.Работает = Истина;
		СведенияОСотруднике.Картинка = 1;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров обработки.
// 
// Возвращаемое значение:
//  Структура:
//     * Организация - СправочникСсылка.Организации - Организация, по которой формируются данные.
//     * РолиСотрудников - ПеречислениеСсылка.РолиСотрудников - Фильтр по ролям сотрудников.
//     * ПериодРегистрации - Дата - Месяц, за который формируются данные.
//     * ТекущаяДатаРаботы - Дата - Текущая дата, используемая для определения периодов расчета.
//     * Параметр - Произвольный - Дополнительный параметр для отбора сотрудников в том случае,
//                                 если массив сотрудников не был передан в параметрах.
//     * МассивСотрудников - Массив из СправочникСсылка.Сотрудники, Неопределено - сотрудники для ограничения выборки. Если не задан, данные формируются по всем.
//     * ВключатьСведенияПоСотрудникам - Булево - Признак того, что нужно включить в результат сведения по сотрудникам.
//
Функция НовыйПараметрыОбработки() Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Организация", Неопределено);
	ПараметрыОбработки.Вставить("РолиСотрудников", Перечисления.РолиСотрудников.ПустаяСсылка());
	ПараметрыОбработки.Вставить("ПериодРегистрации", Неопределено);
	ПараметрыОбработки.Вставить("ТекущаяДатаРаботы", Неопределено);
	ПараметрыОбработки.Вставить("Параметр", Неопределено);
	ПараметрыОбработки.Вставить("МассивСотрудников", Неопределено);
	ПараметрыОбработки.Вставить("ВключатьСведенияПоСотрудникам", Истина);

	Возврат ПараметрыОбработки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаменитьТекстЗапросаСпискаСотрудников(УправляемаяФорма) Экспорт
	
	Список = УправляемаяФорма.Список;
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Список.ТекстЗапроса);
	СхемаЗапросаПакетЗапросов = СхемаЗапроса.ПакетЗапросов[1];
	Источники = СхемаЗапросаПакетЗапросов.Операторы[0].Источники;
	Колонки = СхемаЗапросаПакетЗапросов.Колонки;

	// Добавим необходимые источники
	// Условия соединения
	ИсточникиСотрудники = Источники.НайтиПоИмени("Справочник.Сотрудники");
	УсловияСоединения = Новый Массив;
	УсловияСоединения.Добавить("СправочникСотрудники.Ссылка = ОсновныеСотрудникиФизическихЛиц.Сотрудник");
	УсловияСоединения.Добавить("&МаксимальнаяДатаНачалоДня = ОсновныеСотрудникиФизическихЛиц.ДатаОкончания");
	
	ОсновныеСотрудникиФизическихЛиц = Источники.НайтиПоИмени("РегистрСведений.ОсновныеСотрудникиФизическихЛиц");
	Если ОсновныеСотрудникиФизическихЛиц = Неопределено Тогда
		ОсновныеСотрудникиФизическихЛиц = Источники.Добавить("РегистрСведений.ОсновныеСотрудникиФизическихЛиц", "ОсновныеСотрудникиФизическихЛиц");
		ОсновныеСотрудникиФизическихЛиц.Соединения.Очистить();
	КонецЕсли;
	
	ИсточникиСотрудники.Соединения.Добавить(ОсновныеСотрудникиФизическихЛиц, СтрСоединить(УсловияСоединения, " И "));
	
	УсловияСоединения.Очистить();
	УсловияСоединения.Добавить("СправочникСотрудники.Ссылка = КадроваяИсторияСотрудниковИнтервальный.Сотрудник");
	УсловияСоединения.Добавить("&МаксимальнаяДатаКонецДня = КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания");
	
	КадроваяИсторияСотрудниковИнтервальный = Источники.НайтиПоИмени("РегистрСведений.КадроваяИсторияСотрудниковИнтервальный");
	Если КадроваяИсторияСотрудниковИнтервальный = Неопределено Тогда
		КадроваяИсторияСотрудниковИнтервальный = Источники.Добавить("РегистрСведений.КадроваяИсторияСотрудниковИнтервальный", "КадроваяИсторияСотрудниковИнтервальный");
		КадроваяИсторияСотрудниковИнтервальный.Соединения.Очистить();
	КонецЕсли;
	
	ИсточникиСотрудники.Соединения.Добавить(КадроваяИсторияСотрудниковИнтервальный, СтрСоединить(УсловияСоединения, " И "));
	
	УсловияСоединения.Очистить();
	УсловияСоединения.Добавить("СправочникСотрудники.Ссылка = ВидыЗанятостиСотрудниковИнтервальный.Сотрудник");
	УсловияСоединения.Добавить("&МаксимальнаяДатаКонецДня = ВидыЗанятостиСотрудниковИнтервальный.ДатаОкончания");
	
	ВидыЗанятостиСотрудниковИнтервальный = Источники.НайтиПоИмени("РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный");
	Если ВидыЗанятостиСотрудниковИнтервальный = Неопределено Тогда
		ВидыЗанятостиСотрудниковИнтервальный = Источники.Добавить("РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный", "ВидыЗанятостиСотрудниковИнтервальный");
		ВидыЗанятостиСотрудниковИнтервальный.Соединения.Очистить();
	КонецЕсли;
	
	ИсточникиСотрудники.Соединения.Добавить(ВидыЗанятостиСотрудниковИнтервальный, СтрСоединить(УсловияСоединения, " И "));
	
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].ВыбираемыеПоля;

	ВидЗанятости = Новый ВыражениеСхемыЗапроса(
		"ЕСТЬNULL(ВидыЗанятостиСотрудниковИнтервальный.ВидЗанятости, ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка))");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ВидЗанятости", ВидЗанятости);
	
	ОсновноеРабочееМестоВОрганизации = Новый ВыражениеСхемыЗапроса(
		"ВЫБОР
		|		КОГДА ОсновныеСотрудникиФизическихЛиц.Сотрудник ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ ");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ОсновноеРабочееМестоВОрганизации", ОсновноеРабочееМестоВОрганизации);

	ТекущаяОрганизация = Новый ВыражениеСхемыЗапроса("
		|ВЫБОР
		|		КОГДА ЕСТЬNULL(КадроваяИсторияСотрудниковИнтервальный.Организация,
		|			ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|				КОГДА РолиСотрудниковДоговорник.Сотрудник ЕСТЬ NULL
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ИНАЧЕ РолиСотрудниковДоговорник.Сотрудник.ГоловнаяОрганизация
		|			КОНЕЦ
		|		ИНАЧЕ КадроваяИсторияСотрудниковИнтервальный.Организация
		|	КОНЕЦ");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ТекущаяОрганизация", ТекущаяОрганизация);
	
	ТекущееПодразделение = Новый ВыражениеСхемыЗапроса("ЕСТЬNULL(КадроваяИсторияСотрудниковИнтервальный.Подразделение,
		|		ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ТекущееПодразделение", ТекущееПодразделение);
	
	ТекущаяДолжность = Новый ВыражениеСхемыЗапроса(
		"ЕСТЬNULL(КадроваяИсторияСотрудниковИнтервальный.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка))");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ТекущаяДолжность", ТекущаяДолжность);
	
	ОформленПоТрудовомуДоговору = Новый ВыражениеСхемыЗапроса(
		"ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору, ЛОЖЬ)");
	ЗаменитьВыражение(ВыбираемыеПоля, Колонки, "ОформленПоТрудовомуДоговору", ОформленПоТрудовомуДоговору);
	
	Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "МаксимальнаяДатаНачалоДня", НачалоДня(ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата()), Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "МаксимальнаяДатаКонецДня", ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата(), Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает массив сотрудников, вычисленный из значения 
// переданного в Параметр, обработчиком оповещения
// Параметры:
//   Параметр- Структура, СправочникСсылка.Сотрудники,
//             ДокументСсылка.НачислениеЗарплаты,
//             ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк, ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу,
//             ДокументСсылка.Отпуск, ДокументСсылка.БольничныйЛист,
//             ДокументСсылка.ПриемНаРаботу, ДокументСсылка.КадровыйПеревод,
//             ДокументСсылка.Увольнение
//
Функция МассивСотрудниковПоПараметру(Организация, Параметр)
	
	МассивСотрудников = Новый Массив;
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Сотрудники") Тогда
		Если Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметр, "ГоловнаяОрганизация") Тогда
			МассивСотрудников.Добавить(Параметр);
		КонецЕсли;
		Возврат МассивСотрудников;
	КонецЕсли;
	
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		Если Параметр.Свойство("Сотрудник") Тогда
			Если Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметр.Сотрудник, "ГоловнаяОрганизация") Тогда
				МассивСотрудников.Добавить(Параметр.Сотрудник);
			КонецЕсли;
		КонецЕсли;
		Возврат МассивСотрудников;
	КонецЕсли;
	
	Если Организация <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметр, "Организация") Тогда
		Возврат МассивСотрудников;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметр);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата КАК ВедомостьНаВыплатуЗарплатыВБанкЗарплата
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Сотрудник
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ВедомостьНаВыплатуЗарплатыВКассуЗарплата
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыСотрудники.Сотрудник.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.Сотрудники КАК НачислениеЗарплатыСотрудники
	|ГДЕ
	|	НачислениеЗарплатыСотрудники.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отпуск.Сотрудник
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БольничныйЛист.Сотрудник
	|ИЗ
	|	Документ.БольничныйЛист КАК БольничныйЛист
	|ГДЕ
	|	БольничныйЛист.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровыйПеревод.Сотрудник
	|ИЗ
	|	Документ.КадровыйПеревод КАК КадровыйПеревод
	|ГДЕ
	|	КадровыйПеревод.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Увольнение.Сотрудник
	|ИЗ
	|	Документ.Увольнение КАК Увольнение
	|ГДЕ
	|	Увольнение.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботу.Сотрудник
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Сотрудники.Сотрудник
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСотрудников.Добавить(Выборка.Сотрудник);
	КонецЦикла;
	
	Возврат МассивСотрудников;
	
КонецФункции

Процедура УстановитьСтатусыСотрудников(ТаблицаСотрудников, ПериодРегистрации)
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаСотрудников Цикл
		УстановитьСтатусСотрудника(СтрокаТаблицы, ПериодРегистрации);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьВыражение(ВыбираемыеПоля, Колонки, ИмяПоля, Выражение)
	
	ИндексКолонки = Колонки.Индекс(Колонки.Найти(ИмяПоля));
	ВыбираемыеПоля[ИндексКолонки] = Выражение;
	
КонецПроцедуры

Процедура УдалитьСведенияОСотрудниках(ТекстЗапроса)

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	КоличествоПакетов = СхемаЗапроса.ПакетЗапросов.Количество();
	ПоследнийПакет = СхемаЗапроса.ПакетЗапросов[КоличествоПакетов - 1];

	ПоляДляУдаления = Новый Массив;
	ПоляДляУдаления.Добавить("СправочникСотрудники.ВерсияДанных");
	ПоляДляУдаления.Добавить("СправочникСотрудники.Предопределенный");
	ПоляДляУдаления.Добавить("СправочникСотрудники.Код");
	ПоляДляУдаления.Добавить("СправочникСотрудники.Наименование");
	ПоляДляУдаления.Добавить("СправочникСотрудники.ФизическоеЛицо");
	ПоляДляУдаления.Добавить("СправочникСотрудники.ГоловнаяОрганизация");
	ПоляДляУдаления.Добавить("СправочникСотрудники.ТекущийПроцентСевернойНадбавки");
	ПоляДляУдаления.Добавить("СправочникСотрудники.ВАрхиве");
	ПоляДляУдаления.Добавить("СправочникСотрудники.УточнениеНаименования");
	ПоляДляУдаления.Добавить("СправочникСотрудники.ГоловнойСотрудник");
	ПоляДляУдаления.Добавить("ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка))");
	ПоляДляУдаления.Добавить("ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации, ЛОЖЬ)");
	ПоляДляУдаления.Добавить("ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))");
	ПоляДляУдаления.Добавить("ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|		ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))");
	ПоляДляУдаления.Добавить("ЕСТЬNULL(ВТ_ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка))");

	Для Каждого ИмяПоля Из ПоляДляУдаления Цикл
		Поле = ПоследнийПакет.Операторы[0].ВыбираемыеПоля.Найти(ИмяПоля);
		Если Поле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексПоля = ПоследнийПакет.Операторы[0].ВыбираемыеПоля.Индекс(Поле);
		
		Если ИндексПоля <> Неопределено Тогда
			ПоследнийПакет.Операторы[0].ВыбираемыеПоля.Удалить(ИндексПоля);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
